_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_8 (Embedding)      (None, 12681, 3)          63        
_________________________________________________________________
flatten_8 (Flatten)          (None, 38043)             0         
_________________________________________________________________
dense_27 (Dense)             (None, 33)                1255452   
_________________________________________________________________
dropout_11 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_12 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_29 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_13 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 34        
=================================================================
Total params: 1,257,793
Trainable params: 1,257,793
Non-trainable params: 0