_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_2 (Embedding)      (None, 12681, 3)          63        
_________________________________________________________________
flatten_2 (Flatten)          (None, 38043)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 33)                1255452   
_________________________________________________________________
dropout_4 (Dropout)          (None, 33)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 33)                1122      
_________________________________________________________________
dropout_5 (Dropout)          (None, 33)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 33)                1122      
_________________________________________________________________
dropout_6 (Dropout)          (None, 33)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 34        
=================================================================
Total params: 1,257,793
Trainable params: 1,257,793
Non-trainable params: 0