_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_4 (Embedding)      (None, 12681, 5)          105       
_________________________________________________________________
flatten_4 (Flatten)          (None, 63405)             0         
_________________________________________________________________
dense_13 (Dense)             (None, 33)                2092398   
_________________________________________________________________
dropout_10 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_14 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_11 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_12 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 34        
=================================================================
Total params: 2,094,781
Trainable params: 2,094,781
Non-trainable params: 0
_________________________________________________________________