_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_6 (Embedding)      (None, 12681, 5)          105       
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 12677, 64)         1664      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 4225, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 270400)            0         
_________________________________________________________________
dense_21 (Dense)             (None, 33)                8923233   
_________________________________________________________________
dropout_16 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_17 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_18 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 34        
=================================================================
Total params: 8,927,280
Trainable params: 8,927,280
Non-trainable params: 0
_______________________________________________________