_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_7 (Embedding)      (None, 12681, 3)          63        
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 12677, 64)         1024      
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 4225, 64)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 270400)            0         
_________________________________________________________________
dense_25 (Dense)             (None, 33)                8923233   
_________________________________________________________________
dropout_19 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_20 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_27 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_21 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 1)                 34        
=================================================================
Total params: 8,926,598
Trainable params: 8,926,598
Non-trainable params: 0