_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 12681, 3)          63        
_________________________________________________________________
flatten_1 (Flatten)          (None, 38043)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 33)                1255452   
_________________________________________________________________
dropout_1 (Dropout)          (None, 33)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 33)                1122      
_________________________________________________________________
dropout_2 (Dropout)          (None, 33)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 33)                1122      
_________________________________________________________________
dropout_3 (Dropout)          (None, 33)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 34        
=================================================================
Total params: 1,257,793
Trainable params: 1,257,793
Non-trainable params: 0