_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_9 (Embedding)      (None, 12681, 3)          63        
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 12676, 64)         1216      
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 6338, 64)          0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 6334, 64)          20544     
_________________________________________________________________
max_pooling1d_8 (MaxPooling1 (None, 3167, 64)          0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 3164, 64)          16448     
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, 1582, 64)          0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 101248)            0         
_________________________________________________________________
dense_33 (Dense)             (None, 33)                3341217   
_________________________________________________________________
dropout_25 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_34 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_26 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_35 (Dense)             (None, 33)                1122      
_________________________________________________________________
dropout_27 (Dropout)         (None, 33)                0         
_________________________________________________________________
dense_36 (Dense)             (None, 1)                 34        
=================================================================
Total params: 3,381,766
Trainable params: 3,381,766
Non-trainable params: 0